Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/2.0.37/atdf/ATSAML11E15A.atdf
          </instance>
          <instance name="CoreDebug_NS">
            <register-group name="CoreDebug_NS" name-in-module="CoreDebug" address-space="base" offset="0xE002EDF0"/>
          </instance>
        </module>
        <module name="DIB" version="1.0.0">
          <instance name="DIB">
            <register-group name="DIB" name-in-module="DIB" address-space="base" offset="0xE000EFB0"/>
          </instance>
          <instance name="DIB_NS">
            <register-group name="DIB_NS" name-in-module="DIB" address-space="base" offset="0xE002EFB0"/>
          </instance>
        </module>
        <module name="DWT" version="1.0.0">
          <instance name="DWT">
            <register-group name="DWT" name-in-module="DWT" address-space="base" offset="0xE0001000"/>
            <parameters>
              <param name="__WPT_NUM" value="2" caption="Number of DWT watchpoint comparators"/>
            </parameters>
          </instance>
        </module>
        <module name="FPB" version="1.0.0">
          <instance name="FPB">
            <register-group name="FPB" name-in-module="FPB" address-space="base" offset="0xE0002000"/>
            <parameters>
              <param name="__BKPT_NUM" value="4" caption="Number of FPB breakpoint comparators"/>
            </parameters>
          </instance>
        </module>
        <module name="ICB" version="1.0.0">
          <instance name="ICB">
            <register-group name="ICB" name-in-module="ICB" address-space="base" offset="0xE000E000"/>
          </instance>
          <instance name="ICB_NS">
            <register-group name="ICB_NS" name-in-module="ICB" address-space="base" offset="0xE002E000"/>
          </instance>
        </module>
        <module name="MPU" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
            <parameters>
              <param name="__MPU_S_REGIONS" value="4" caption="Number of MPU_S regions"/>
            </parameters>
          </instance>
          <instance name="MPU_NS">
            <register-group name="MPU_NS" name-in-module="MPU" address-space="base" offset="0xE002ED90"/>
            <parameters>
              <param name="__MPU_NS_REGIONS" value="4" caption="Number of MPU_NS regions"/>
            </parameters>
          </instance>
        </module>
        <module name="NVIC" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
          </instance>
          <instance name="NVIC_NS">
            <register-group name="NVIC_NS" name-in-module="NVIC" address-space="base" offset="0xE002E100"/>
          </instance>
        </module>
        <module name="SCB" version="1.0.0">
          <instance name="SCB">
            <register-group name="SCB" name-in-module="SCB" address-space="base" offset="0xE000ED00"/>
          </instance>
          <instance name="SCB_NS">
            <register-group name="SCB_NS" name-in-module="SCB" address-space="base" offset="0xE002ED00"/>
          </instance>
        </module>
        <module name="SysTick" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
          </instance>
          <instance name="SysTick_NS">
            <register-group name="SysTick_NS" name-in-module="SysTick" address-space="base" offset="0xE002E010"/>
          </instance>
        </module>
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset" header:alternate-caption="Reset Vector"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted" header:alternate-caption="Non-maskable Interrupt"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault" header:alternate-caption="Hard Fault"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction" header:alternate-caption="SuperVisor Call"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service" header:alternate-caption="Pendable SerVice"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="SYSTEM" index="0" module-instance="MCLK OSCCTRL OSC32KCTRL PM SUPC" caption="System peripherals shared interrupt"/>
        <interrupt name="WDT" index="1" module-instance="WDT" caption="Watchdog Timer"/>
        <interrupt name="RTC" index="2" module-instance="RTC" caption="Real Time Counter"/>
        <interrupt name="EIC_0" index="3" module-instance="EIC" caption="External Channel 0"/>
        <interrupt name="EIC_1" index="4" module-instance="EIC" caption="External Channel 1"/>
        <interrupt name="EIC_2" index="5" module-instance="EIC" caption="External Channel 2"/>
        <interrupt name="EIC_3" index="6" module-instance="EIC" caption="External Channel 3"/>
        <interrupt name="EIC_OTHER" index="7" module-instance="EIC" caption="External Channel 4/5/6/7"/>
        <interrupt name="FREQM" index="8" module-instance="FREQM" caption="Frequency Meter"/>
        <interrupt name="NVMCTRL" index="9" module-instance="NVMCTRL" caption="Non-Volatile Memory Controller"/>
        <interrupt name="PORT" index="10" module-instance="PORT" caption="Port Non-Secure Check"/>
        <interrupt name="DMAC_0" index="11" module-instance="DMAC" caption="DMA Channel 0"/>
        <interrupt name="DMAC_1" index="12" module-instance="DMAC" caption="DMA Channel 1"/>
        <interrupt name="DMAC_2" index="13" module-instance="DMAC" caption="DMA Channel 2"/>
        <interrupt name="DMAC_3" index="14" module-instance="DMAC" caption="DMA Channel 3"/>
        <interrupt name="DMAC_OTHER" index="15" module-instance="DMAC" caption="DMA Channel 4..X"/>
        <interrupt name="EVSYS_0" index="16" module-instance="EVSYS" caption="Event System Channel 0"/>
        <interrupt name="EVSYS_1" index="17" module-instance="EVSYS" caption="Event System Channel 1"/>
        <interrupt name="EVSYS_2" index="18" module-instance="EVSYS" caption="Event System Channel 2"/>
        <interrupt name="EVSYS_3" index="19" module-instance="EVSYS" caption="Event System Channel 3"/>
        <interrupt name="EVSYS_NSCHK" index="20" module-instance="EVSYS" caption="Event System Non-Secure Check"/>
        <interrupt name="PAC" index="21" module-instance="PAC" caption="Peripheral Access Controller"/>
        <interrupt name="SERCOM0_0" index="22" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_1" index="23" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_2" index="24" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_OTHER" index="25" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM1_0" index="26" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_1" index="27" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_2" index="28" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_OTHER" index="29" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM2_0" index="30" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_1" index="31" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_2" index="32" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_OTHER" index="33" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="TC0" index="34" module-instance="TC0" caption="Timer Counter 0"/>
        <interrupt name="TC1" index="35" module-instance="TC1" caption="Timer Counter 1"/>
        <interrupt name="TC2" index="36" module-instance="TC2" caption="Timer Counter 2"/>
        <interrupt name="ADC_OTHER" index="37" module-instance="ADC" caption="Analog To Digital Converter"/>
        <interrupt name="ADC_RESRDY" index="38" module-instance="ADC" caption="ADC Result Ready"/>
        <interrupt name="AC" index="39" module-instance="AC" caption="Analog Comparator"/>
        <interrupt name="DAC_UNDERRUN_A" index="40" module-instance="DAC" caption="Digital to Analog Converter"/>
        <interrupt name="DAC_EMPTY" index="41" module-instance="DAC" caption="DAC Buffer 0 Empty"/>
        <interrupt name="PTC" index="42" module-instance="PTC" caption="Peripheral Touch Controller"/>
        <interrupt name="TRNG" index="43" module-instance="TRNG" caption="True Random Generator"/>
        <interrupt name="TRAM" index="44" module-instance="TRAM" caption="Trust Ram"/>
      </interrupts>
      <events>
        <generators>
          <generator name="OSCCTRL_CLKFAIL" index="1" module-instance="OSCCTRL"/>
          <generator name="OSC32KCTRL_CLKFAIL" index="2" module-instance="OSC32KCTRL"/>
          <generator name="SUPC_BOD33DET" index="3" module-instance="SUPC"/>
          <generator name="RTC_PER_0" index="4" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="5" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="6" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="8" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="9" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="10" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="11" module-instance="RTC"/>
          <generator name="RTC_ALARM_0" index="12" module-instance="RTC"/>
          <generator name="RTC_CMP_0" index="12" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="13" module-instance="RTC"/>
          <generator name="RTC_TAMPER" index="14" module-instance="RTC"/>
          <generator name="RTC_OVF" index="15" module-instance="RTC"/>
          <generator name="RTC_PERD" index="16" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="17" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="18" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="19" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="20" module-instance="EIC"/>
          <generator name="EIC_EXTINT_4" index="21" module-instance="EIC"/>
          <generator name="EIC_EXTINT_5" index="22" module-instance="EIC"/>
          <generator name="EIC_EXTINT_6" index="23" module-instance="EIC"/>
          <generator name="EIC_EXTINT_7" index="24" module-instance="EIC"/>
          <generator name="DMAC_CH_0" index="25" module-instance="DMAC"/>
          <generator name="DMAC_CH_1" index="26" module-instance="DMAC"/>
          <generator name="DMAC_CH_2" index="27" module-instance="DMAC"/>
          <generator name="DMAC_CH_3" index="28" module-instance="DMAC"/>
          <generator name="TC0_OVF" index="29" module-instance="TC0"/>
          <generator name="TC0_MCX_0" index="30" module-instance="TC0"/>
          <generator name="TC0_MCX_1" index="31" module-instance="TC0"/>
          <generator name="TC1_OVF" index="32" module-instance="TC1"/>
          <generator name="TC1_MCX_0" index="33" module-instance="TC1"/>
          <generator name="TC1_MCX_1" index="34" module-instance="TC1"/>
          <generator name="TC2_OVF" index="35" module-instance="TC2"/>
          <generator name="TC2_MCX_0" index="36" module-instance="TC2"/>
          <generator name="TC2_MCX_1" index="37" module-instance="TC2"/>
          <generator name="ADC_RESRDY" index="38" module-instance="ADC"/>
          <generator name="ADC_WINMON" index="39" module-instance="ADC"/>
          <generator name="AC_COMP_0" index="40" module-instance="AC"/>
          <generator name="AC_COMP_1" index="41" module-instance="AC"/>
          <generator name="AC_WIN_0" index="42" module-instance="AC"/>
          <generator name="DAC_EMPTY" index="43" module-instance="DAC"/>
          <generator name="TRNG_DATARDY" index="46" module-instance="TRNG"/>
          <generator name="CCL_LUT_0" index="47" module-instance="CCL"/>
          <generator name="CCL_LUT_1" index="48" module-instance="CCL"/>
          <generator name="PAC_ERR" index="49" module-instance="PAC"/>
        </generators>
        <users>
          <user name="OSCCTRL_TUNE" index="0" module-instance="OSCCTRL"/>
          <user name="RTC_TAMPEVT" index="1" module-instance="RTC"/>
          <user name="NVMCTRL_AUTOW" index="2" module-instance="NVMCTRL"/>
          <user name="PORT_EV_0" index="3" module-instance="PORT"/>
          <user name="PORT_EV_1" index="4" module-instance="PORT"/>
          <user name="PORT_EV_2" index="5" module-instance="PORT"/>
          <user name="PORT_EV_3" index="6" module-instance="PORT"/>
          <user name="DMAC_CH_0" index="7" module-instance="DMAC"/>
          <user name="DMAC_CH_1" index="8" module-instance="DMAC"/>
          <user name="DMAC_CH_2" index="9" module-instance="DMAC"/>
          <user name="DMAC_CH_3" index="10" module-instance="DMAC"/>
          <user name="TC0_EVU" index="11" module-instance="TC0"/>
          <user name="TC1_EVU" index="12" module-instance="TC1"/>
          <user name="TC2_EVU" index="13" module-instance="TC2"/>
          <user name="ADC_START" index="14" module-instance="ADC"/>
          <user name="ADC_FLUSH" index="15" module-instance="ADC"/>
          <user name="AC_COMP_0" index="16" module-instance="AC"/>
          <user name="AC_COMP_1" index="17" module-instance="AC"/>
          <user name="DAC_START" index="18" module-instance="DAC"/>
          <user name="CCL_LUT_0" index="21" module-instance="CCL"/>
          <user name="CCL_LUT_1" index="22" module-instance="CCL"/>
        </users>
      </events>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x20830001"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2245" version="1.0.2" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
