Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/2.0.37/atdf/ATSAML11E15A.atdf
        <register name="BTCNT" offset="0x2" rw="RW" size="2" caption="Block Transfer Count">
          <bitfield name="BTCNT" caption="Block Transfer Count" mask="0xFFFF"/>
        </register>
        <register name="SRCADDR" offset="0x4" rw="RW" size="4" caption="Block Transfer Source Address">
          <bitfield name="SRCADDR" caption="Transfer Source Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DSTADDR" offset="0x8" rw="RW" size="4" caption="Block Transfer Destination Address">
          <bitfield name="DSTADDR" caption="Transfer Destination Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DESCADDR" offset="0xC" rw="RW" size="4" caption="Next Descriptor Address">
          <bitfield name="DESCADDR" caption="Next Descriptor Address" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="DMAC_BTCTRL__BEATSIZE">
        <value name="BYTE" caption="8-bit bus transfer" value="0x0"/>
        <value name="HWORD" caption="16-bit bus transfer" value="0x1"/>
        <value name="WORD" caption="32-bit bus transfer" value="0x2"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__BLOCKACT">
        <value name="NOACT" caption="Channel will be disabled if it is the last block transfer in the transaction" value="0x0"/>
        <value name="INT" caption="Channel will be disabled if it is the last block transfer in the transaction and block interrupt" value="0x1"/>
        <value name="SUSPEND" caption="Channel suspend operation is completed" value="0x2"/>
        <value name="BOTH" caption="Both channel suspend operation and block interrupt" value="0x3"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__EVOSEL">
        <value name="DISABLE" caption="Event generation disabled" value="0x0"/>
        <value name="BLOCK" caption="Event strobe when block transfer complete" value="0x1"/>
        <value name="BEAT" caption="Event strobe when beat transfer complete" value="0x3"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__STEPSEL">
        <value name="DST" caption="Step size settings apply to the destination address" value="0x0"/>
        <value name="SRC" caption="Step size settings apply to the source address" value="0x1"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__STEPSIZE">
        <value name="X1" caption="Next ADDR = ADDR + (BEATSIZE+1) * 1" value="0x0"/>
        <value name="X2" caption="Next ADDR = ADDR + (BEATSIZE+1) * 2" value="0x1"/>
        <value name="X4" caption="Next ADDR = ADDR + (BEATSIZE+1) * 4" value="0x2"/>
        <value name="X8" caption="Next ADDR = ADDR + (BEATSIZE+1) * 8" value="0x3"/>
        <value name="X16" caption="Next ADDR = ADDR + (BEATSIZE+1) * 16" value="0x4"/>
        <value name="X32" caption="Next ADDR = ADDR + (BEATSIZE+1) * 32" value="0x5"/>
        <value name="X64" caption="Next ADDR = ADDR + (BEATSIZE+1) * 64" value="0x6"/>
        <value name="X128" caption="Next ADDR = ADDR + (BEATSIZE+1) * 128" value="0x7"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCBEATSIZE">
        <value name="BYTE" caption="8-bit bus transfer" value="0x0"/>
        <value name="HWORD" caption="16-bit bus transfer" value="0x1"/>
        <value name="WORD" caption="32-bit bus transfer" value="0x2"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCPOLY">
        <value name="CRC16" caption="CRC-16 (CRC-CCITT)" value="0x0"/>
        <value name="CRC32" caption="CRC32 (IEEE 802.3)" value="0x1"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCSRC">
        <value name="NOACT" caption="No action" value="0x00"/>
        <value name="IO" caption="I/O interface" value="0x01"/>
        <value name="CHN0" caption="DMA Channel 0" value="0x20"/>
        <value name="CHN1" caption="DMA Channel 1" value="0x21"/>
        <value name="CHN2" caption="DMA Channel 2" value="0x22"/>
        <value name="CHN3" caption="DMA Channel 3" value="0x23"/>
        <value name="CHN4" caption="DMA Channel 4" value="0x24"/>
        <value name="CHN5" caption="DMA Channel 5" value="0x25"/>
        <value name="CHN6" caption="DMA Channel 6" value="0x26"/>
        <value name="CHN7" caption="DMA Channel 7" value="0x27"/>
      </value-group>
      <value-group name="DMAC_QOSCTRL__DQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_QOSCTRL__FQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_QOSCTRL__WRBQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__CMD">
        <value name="NOACT" caption="No action" value="0x0"/>
        <value name="SUSPEND" caption="Channel suspend operation" value="0x1"/>
        <value name="RESUME" caption="Channel resume operation" value="0x2"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__EVACT">
        <value name="NOACT" caption="No action" value="0x0"/>
        <value name="TRIG" caption="Transfer and periodic transfer trigger" value="0x1"/>
        <value name="CTRIG" caption="Conditional transfer trigger" value="0x2"/>
        <value name="CBLOCK" caption="Conditional block transfer" value="0x3"/>
        <value name="SUSPEND" caption="Channel suspend operation" value="0x4"/>
        <value name="RESUME" caption="Channel resume operation" value="0x5"/>
        <value name="SSKIP" caption="Skip next block suspend action" value="0x6"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__TRIGACT">
        <value name="BLOCK" caption="One trigger required for each block transfer" value="0x0"/>
        <value name="BEAT" caption="One trigger required for each beat transfer" value="0x2"/>
        <value name="TRANSACTION" caption="One trigger required for each transaction" value="0x3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__TRIGSRC">
        <value name="DISABLE" caption="Only software/event triggers" value="0x00"/>
        <value name="RTC_TIMESTAMP" caption="RTC Timestamp Trigger" value="0x01"/>
        <value name="DSU_DCC0" caption="ID for DCC0 register" value="0x02"/>
        <value name="DSU_DCC1" caption="ID for DCC1 register" value="0x03"/>
        <value name="SERCOM0_RX" caption="SERCOM0 RX Trigger" value="0x04"/>
        <value name="SERCOM0_TX" caption="SERCOM0 TX Trigger" value="0x05"/>
        <value name="SERCOM1_RX" caption="SERCOM1 RX Trigger" value="0x06"/>
        <value name="SERCOM1_TX" caption="SERCOM1 TX Trigger" value="0x07"/>
        <value name="SERCOM2_RX" caption="SERCOM2 RX Trigger" value="0x08"/>
        <value name="SERCOM2_TX" caption="SERCOM2 TX Trigger" value="0x09"/>
        <value name="TC0_OVF" caption="TC0 Overflow Trigger" value="0x0A"/>
        <value name="TC0_MC0" caption="TC0 Match/Compare 0 Trigger" value="0x0B"/>
        <value name="TC0_MC1" caption="TC0 Match/Compare 1 Trigger" value="0x0C"/>
        <value name="TC1_OVF" caption="TC1 Overflow Trigger" value="0x0D"/>
        <value name="TC1_MC0" caption="TC1 Match/Compare 0 Trigger" value="0x0E"/>
        <value name="TC1_MC1" caption="TC1 Match/Compare 1 Trigger" value="0x0F"/>
        <value name="TC2_OVF" caption="TC2 Overflow Trigger" value="0x10"/>
        <value name="TC2_MC0" caption="TC2 Match/Compare 0 Trigger" value="0x11"/>
        <value name="TC2_MC1" caption="TC2 Match/Compare 1 Trigger" value="0x12"/>
        <value name="ADC_RESRDY" caption="ADC Result Ready Trigger" value="0x13"/>
        <value name="DAC_EMPTY" caption="DAC Empty Trigger" value="0x14"/>
        <value name="PTC_EOC" caption="PTC End of Conversion Trigger" value="0x15"/>
        <value name="PTC_SEQ" caption="PTC Sequence Trigger" value="0x16"/>
        <value name="PTC_WCOMP" caption="PTC Window Compare Trigger" value="0x17"/>
      </value-group>
    </module>
    <module name="DSU" id="U2810" version="1.0.0" caption="Device Service Unit">
      <register-group name="DSU" caption="Device Service Unit">
        <register name="CTRL" offset="0x0" rw="W" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="CRC" caption="32-bit Cyclic Redundancy Code" mask="0x4"/>
          <bitfield name="MBIST" caption="Memory built-in self-test" mask="0x8"/>
        </register>
        <register name="STATUSA" offset="0x1" rw="RW" size="1" initval="0x00" caption="Status A">
          <bitfield name="DONE" caption="Done" mask="0x1"/>
          <bitfield name="CRSTEXT" caption="CPU Reset Phase Extension" mask="0x2"/>
          <bitfield name="BERR" caption="Bus Error" mask="0x4"/>
          <bitfield name="FAIL" caption="Failure" mask="0x8"/>
          <bitfield name="PERR" caption="Protection Error Detected by the State Machine" mask="0x10"/>
          <bitfield name="BREXT" caption="BootRom Phase Extension" mask="0x20"/>
        </register>
        <register name="STATUSB" offset="0x2" rw="R" size="1" initval="0x00" caption="Status B">
          <bitfield name="DAL" caption="Debugger Access Level" mask="0x3" values="DSU_STATUSB__DAL"/>
          <bitfield name="DBGPRES" caption="Debugger Present" mask="0x4"/>
          <bitfield name="HPE" caption="Hot-Plugging Enable" mask="0x8"/>
          <bitfield name="DCCD0" caption="Debug Communication Channel 0 Dirty" mask="0x10"/>
          <bitfield name="DCCD1" caption="Debug Communication Channel 1 Dirty" mask="0x20"/>
          <bitfield name="BCCD0" caption="Boot ROM Communication Channel 0 Dirty" mask="0x40"/>
          <bitfield name="BCCD1" caption="Boot ROM Communication Channel 1 Dirty" mask="0x80"/>
        </register>
